#  Pandas Basics

In [1]:
import pandas as pd

In [2]:
df1=pd.read_csv('C:\\Users\\Harishankar Sharma\\Desktop\\dataset\\Data_Pre.csv')               # Read .csv file
df1

    Age  Systolic Blood Pressure      State Diabetic
0  39.0                    144.0         UP       No
1  47.0                    220.0         MP      Yes
2  45.0                      NaN     Kerala       No
3  47.0                    145.0         UP       No
4  65.0                    162.0         MP      Yes
5   NaN                    142.0         MP       No
6  67.0                    170.0     Kerala      Yes
7  42.0                    124.0  Rajasthan       No
8  67.0                    158.0         MP      Yes
9  56.0                    154.0         UP       No

In [3]:
df1['Age'].max()                                                              # Maximum Age

67.0

In [4]:
df1['Age'].mean()                                                             # Average Age

52.77777777777778

In [5]:
weather_data={                                                                      # Create DaraFrame Using dictionary
    
    'day':['1/1/2017', '1/2/2017','1/3/2017','1/4/2017','1/5/2017','1/6/2017'],
    'event':['rain','sunny','snow','snow','rain','sunny'],
    'temperature':[32,35,38,24,32,31],
    'windspeed':[6,7,2,8,7,9]

}
df=pd.DataFrame(weather_data)
df

        day  event  temperature  windspeed
0  1/1/2017   rain           32          6
1  1/2/2017  sunny           35          7
2  1/3/2017   snow           38          2
3  1/4/2017   snow           24          8
4  1/5/2017   rain           32          7
5  1/6/2017  sunny           31          9

In [6]:
rows, Columns= df.shape

In [7]:
rows

6

In [8]:
Columns

4

In [9]:
df.head()                                                                   # For Print some top rows

        day  event  temperature  windspeed
0  1/1/2017   rain           32          6
1  1/2/2017  sunny           35          7
2  1/3/2017   snow           38          2
3  1/4/2017   snow           24          8
4  1/5/2017   rain           32          7

In [10]:
df.head(2)                                                                       # Print only 2 rows

        day  event  temperature  windspeed
0  1/1/2017   rain           32          6
1  1/2/2017  sunny           35          7

In [11]:
df.tail()                                                                        # Print some bottom rows

        day  event  temperature  windspeed
1  1/2/2017  sunny           35          7
2  1/3/2017   snow           38          2
3  1/4/2017   snow           24          8
4  1/5/2017   rain           32          7
5  1/6/2017  sunny           31          9

In [12]:
df.tail(1)                                                                            # Print last 1 rows

        day  event  temperature  windspeed
5  1/6/2017  sunny           31          9

In [13]:
df

        day  event  temperature  windspeed
0  1/1/2017   rain           32          6
1  1/2/2017  sunny           35          7
2  1/3/2017   snow           38          2
3  1/4/2017   snow           24          8
4  1/5/2017   rain           32          7
5  1/6/2017  sunny           31          9

In [14]:
df[2:8]                                                         # Print from 2nd row to last row

        day  event  temperature  windspeed
2  1/3/2017   snow           38          2
3  1/4/2017   snow           24          8
4  1/5/2017   rain           32          7
5  1/6/2017  sunny           31          9

In [15]:
df[:]

        day  event  temperature  windspeed
0  1/1/2017   rain           32          6
1  1/2/2017  sunny           35          7
2  1/3/2017   snow           38          2
3  1/4/2017   snow           24          8
4  1/5/2017   rain           32          7
5  1/6/2017  sunny           31          9

In [16]:
df[0::2]                                                                   # Print from start but skipping 1 row

        day event  temperature  windspeed
0  1/1/2017  rain           32          6
2  1/3/2017  snow           38          2
4  1/5/2017  rain           32          7

In [17]:
df.columns                                                                 # Print columns name

Index(['day', 'event', 'temperature', 'windspeed'], dtype='object')

In [18]:
df.day                                                                       # Print Individual Columns

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [19]:
df.event

0     rain
1    sunny
2     snow
3     snow
4     rain
5    sunny
Name: event, dtype: object

In [20]:
df.temperature

0    32
1    35
2    38
3    24
4    32
5    31
Name: temperature, dtype: int64

In [21]:
df1

    Age  Systolic Blood Pressure      State Diabetic
0  39.0                    144.0         UP       No
1  47.0                    220.0         MP      Yes
2  45.0                      NaN     Kerala       No
3  47.0                    145.0         UP       No
4  65.0                    162.0         MP      Yes
5   NaN                    142.0         MP       No
6  67.0                    170.0     Kerala      Yes
7  42.0                    124.0  Rajasthan       No
8  67.0                    158.0         MP      Yes
9  56.0                    154.0         UP       No

In [22]:
df1.columns

Index(['Age', 'Systolic Blood Pressure', 'State', 'Diabetic'], dtype='object')

In [23]:
df1.Age

0    39.0
1    47.0
2    45.0
3    47.0
4    65.0
5     NaN
6    67.0
7    42.0
8    67.0
9    56.0
Name: Age, dtype: float64

In [24]:
df

        day  event  temperature  windspeed
0  1/1/2017   rain           32          6
1  1/2/2017  sunny           35          7
2  1/3/2017   snow           38          2
3  1/4/2017   snow           24          8
4  1/5/2017   rain           32          7
5  1/6/2017  sunny           31          9

In [25]:
df[['event','day']]                                                          # Print some columns

   event       day
0   rain  1/1/2017
1  sunny  1/2/2017
2   snow  1/3/2017
3   snow  1/4/2017
4   rain  1/5/2017
5  sunny  1/6/2017

In [26]:
d=df[['temperature','windspeed']]
d

   temperature  windspeed
0           32          6
1           35          7
2           38          2
3           24          8
4           32          7
5           31          9

In [27]:
type(df)

pandas.core.frame.DataFrame

In [28]:
type(df['windspeed'])

pandas.core.series.Series

In [29]:
d

   temperature  windspeed
0           32          6
1           35          7
2           38          2
3           24          8
4           32          7
5           31          9

In [30]:
df

        day  event  temperature  windspeed
0  1/1/2017   rain           32          6
1  1/2/2017  sunny           35          7
2  1/3/2017   snow           38          2
3  1/4/2017   snow           24          8
4  1/5/2017   rain           32          7
5  1/6/2017  sunny           31          9

In [31]:
df['temperature'].max()                                                   # Maximum temperature

38

In [32]:
df['temperature'].mean()                                                 # Average temperature

32.0

In [33]:
df['temperature'].min()                                                  # Min Temperature

24

In [34]:
df.describe()                                                            # describe() function

       temperature  windspeed
count     6.000000   6.000000
mean     32.000000   6.500000
std       4.690416   2.428992
min      24.000000   2.000000
25%      31.250000   6.250000
50%      32.000000   7.000000
75%      34.250000   7.750000
max      38.000000   9.000000

In [35]:
df[df.temperature>=32]

        day  event  temperature  windspeed
0  1/1/2017   rain           32          6
1  1/2/2017  sunny           35          7
2  1/3/2017   snow           38          2
4  1/5/2017   rain           32          7

In [36]:
df[df.temperature==df.temperature.max()]

        day event  temperature  windspeed
2  1/3/2017  snow           38          2

In [37]:
df[['day','temperature']][df.temperature>=32]

        day  temperature
0  1/1/2017           32
1  1/2/2017           35
2  1/3/2017           38
4  1/5/2017           32

In [38]:
df

        day  event  temperature  windspeed
0  1/1/2017   rain           32          6
1  1/2/2017  sunny           35          7
2  1/3/2017   snow           38          2
3  1/4/2017   snow           24          8
4  1/5/2017   rain           32          7
5  1/6/2017  sunny           31          9

In [39]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [40]:
c=df.set_index('day')                                                           # Set Day Column as Index

In [41]:
c

          event  temperature  windspeed
day
1/1/2017   rain           32          6
1/2/2017  sunny           35          7
1/3/2017   snow           38          2
1/4/2017   snow           24          8
1/5/2017   rain           32          7
1/6/2017  sunny           31          9

In [42]:
c.loc['1/4/2017']                                                    # Check on special day

event          snow
temperature      24
windspeed         8
Name: 1/4/2017, dtype: object

In [43]:
df

        day  event  temperature  windspeed
0  1/1/2017   rain           32          6
1  1/2/2017  sunny           35          7
2  1/3/2017   snow           38          2
3  1/4/2017   snow           24          8
4  1/5/2017   rain           32          7
5  1/6/2017  sunny           31          9

In [44]:
df.loc[5]

day            1/6/2017
event             sunny
temperature          31
windspeed             9
Name: 5, dtype: object